## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
aws_ecr_repository.orchestrator: Refreshing state... [id=aws-java-orchestrator]
aws_sqs_queue.unprocessed_data_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/unprocessed-data-deadletter-queue]
aws_iam_role.lambda_role: Refreshing state... [id=lambda_processor_role]
data.aws_caller_identity.current: Reading...
aws_iam_policy.lambda_code_s3_access: Refreshing state... [id=arn:aws:iam::886360753244:policy/LambdaCodeS3AccessPolicy]
aws_dynamodb_table.processed_data: Refreshing state... [id=processed-data]
aws_sns_topic.notifications: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic]
aws_s3_bucket.data_bucket: Refreshing state... [id=serverless-arch-data-bucket]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=serverless-arch-lambda-bucket]
aws_iam_role.orchestrator_lambda_role: Refreshing state... [id=aws-java-orchestrator-lambda-role]
data.aws_caller_identity.current: Read complete after 0s [id=886360753244]
aws_sqs_queue.processing_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
aws_sqs_queue_redrive_allow_policy.unprocessed_data_redrive_allow_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/unprocessed-data-deadletter-queue]
aws_sns_topic_subscription.sns_to_sqs_sub: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic:3b34f14f-00a8-4c8f-8814-9ed86444c61b]
data.aws_iam_policy_document.sqs_policy: Reading...
data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=963451197]
aws_sqs_queue_policy.queue_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
aws_iam_role_policy_attachment.lambda_code_s3_attach: Refreshing state... [id=lambda_processor_role/arn:aws:iam::886360753244:policy/LambdaCodeS3AccessPolicy]
aws_iam_role_policy.orchestrator_lambda_policy: Refreshing state... [id=aws-java-orchestrator-lambda-role:terraform-20260103134509237100000001]
aws_iam_policy.processor_policy: Refreshing state... [id=arn:aws:iam::886360753244:policy/ProcessorPolicy]
aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=lambda_processor_role/arn:aws:iam::886360753244:policy/ProcessorPolicy]
aws_iam_policy.uploader_policy: Refreshing state... [id=arn:aws:iam::886360753244:policy/UploaderPolicy]
aws_lambda_function.processor: Refreshing state... [id=process-uploaded-file]
aws_lambda_permission.allow_s3: Refreshing state... [id=AllowExecutionFromS3]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=serverless-arch-data-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.orchestrator will be created
  + resource "aws_ecr_lifecycle_policy" "orchestrator" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "sha-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "aws-java-orchestrator"
    }

  # aws_lambda_alias.prod will be created
  + resource "aws_lambda_alias" "prod" {
      + arn              = (known after apply)
      + function_name    = "aws-java-orchestrator"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "prod"
      + region           = "us-east-1"
    }

  # aws_lambda_function.orchestrator will be created
  + resource "aws_lambda_function" "orchestrator" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "aws-java-orchestrator"
      + id                             = (known after apply)
      + image_uri                      = "886360753244.dkr.ecr.us-east-1.amazonaws.com/aws-java-orchestrator:sha-67dc75c3241c579730c639da752ce09982fdff67"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::886360753244:role/aws-java-orchestrator-lambda-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENV" = "prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>